Repository: cnvfirj/flutter_app_beauty_design
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

# background_text_1
source: The search range for a random number cannot exceed 4294967295.
ru: Диапазон поиска не должен превышать 4294967295.
uk: Діапазон пошуку випадкового числа не може перевищувати 4294967295.

# background_text_2
source: Minimum search boundary is limited by value -9999999999.
ru: Минимальная граница поиска -9999999999.
uk: Мінімальна межа пошуку обмежена значенням -9999999999.

# background_text_3
source: Maximum search boundary is limited by value 9999999999.
ru: Максимальная граница поиска 9999999999.
uk: Максимальна межа пошуку обмежена значенням 9999999999.

# widget_generator
source: Number generator
ru: Генератор чисел
uk: Генератор чисел

# widget_history
source: Number generation history
ru: История сгенерированых чисел
uk: Історія сгенерованих чисел

# widget_excluded
source: Excluded values
ru: Исключенные значения
uk: Виключені значення

# widget_boundaries
source: Search boundaries
ru: Границы поиска
uk: Межі пошуку

# widget_add_exclude
source: Entering a value
ru: Введи значение
uk: Введи значення

source: from
ru: от
uk: від

source: to
ru: до
uk: до

source: enter
ru: ввод
uk: ввід

# massage_blank_field_generator
source: Generate a random number
ru: Сгенерируй случайное сичло
uk: Згенеруй випадкове число

# massage_blank_fields_boundaries
source: Set the boundaries of number generation
ru: Установи границы генерации чисел
uk: Встановіть межі генерації чисел

# massage_error_fields_boundaries
source: Adjust the number generation boundaries
ru: Настрой границы генерации чисел
uk: Налаштуй межі генерації чисел

# massage_error_ex
source: Adjust the list of exclusions
ru: Откорректируй список исключений
uk: Відкоригуй список виключень

# massage_blank_boundaries
source: Enter the search range
ru: Введи диапазон поиска
uk: Введи діапазон пошуку

# massage_ex_add
source: Exception added
ru: Исключение добавлено
uk: Виключення додано

# massage_ex_no_add
source: No exception added
ru: Исключение не добавлено
uk: Виключення не додано

# massage_ex_fill
source: The exception is already in the list
ru: Исключение уже есть в списке
uk: Виключення вже є у списку

# background_text_list_ex
source: The list is empty
ru: Список пустой
uk: Список порожній
